# Tap sources
tap "caskroom/versions"
tap "cloudfoundry/tap"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

cask 'firefox'
cask 'google-chrome'
cask 'chromedriver'

cask 'slack'
cask 'signal'

cask 'alacritty'
cask 'docker'
cask 'visual-studio-code'
cask 'db-browser-for-sqlite'
cask 'github'
cask 'wireshark'
cask 'zoom'
cask 'vlc'
cask 'postman'
cask 'mullvadvpn'

brew 'rbenv'
brew 'pyenv'

brew 'node'
brew 'yarn'
brew 'go'

brew 'ipython'
brew 'jupyterlab'

brew 'zsh'
brew 'bash'

brew 'zsh-completions'
brew 'direnv'

brew 'postgresql'
brew 'mysql', restart_service: true
brew 'sqlite'

brew 'jq'
brew 'yq'
brew 'ncdu'
brew 'tree'
brew 'fzf'
brew 'ripgrep'
brew 'parallel'
brew 'watch'
brew 'pv'

brew 'diff-so-fancy'
brew 'bat'

brew 'nmap'
brew 'dnsmasq', restart_service: true

brew 'vim'
brew 'tmux'
brew 'screen'

brew 'gh'
brew 'heroku'
brew "heroku/brew/heroku"
brew "cloudfoundry/tap/cf-cli"

brew 'arduino-cli'
brew 'awscli'
brew 'kubernetes-cli'

brew 'mkcert'
